# AnalysisDisplayVectorSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings Constructor
AnalysisDisplayVectorSettings Class See Also
---
Constructs a default instance of vector settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayVectorSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayVectorSettings()
```

# See Also
AnalysisDisplayVectorSettings Class
AnalysisDisplayVectorSettings Overload
Autodesk.Revit.DB.Analysis Namespace